

var data = {
  'code': '0',
  'message': '0',
  'data':{
    'channel': [{
       'id': 'Tr001',
       'date': '2024/9/3',
       'time': '16:50',
       'name': '开启电灯服务',
       'resource': [{'电力': '1度'}, {'水力': '1立方米'}]
    },
    {
       'id': 'Tr002',
       'date': '2024/9/3',
       'time': '16:50',
       'name': '开启电灯服务',
       'resource': [{'电力': '1度'}, {'水力': '1立方米'}]
    },
    {
       'id': 'Tr003',
       'date': '2024/9/3',
       'time': '16:50',
       'name': '开启电灯服务',
       'resource': [{'电力': '1度'}, {'水力': '1立方米'}]
    },
    {
       'id': 'Tr004',
       'date': '2024/9/3',
       'time': '16:50',
       'name': '开启电灯服务',
       'resource': [{'电力': '1度'}, {'水力': '1立方米'}]
    },
       {
       'id': 'Tr005',
       'date': '2024/9/3',
       'time': '16:50',
       'name': '开启电灯服务',
       'resource': [{'电力': '1度'}, {'水力': '1立方米'}]
    },
       {
       'id': 'Tr006',
       'date': '2024/9/3',
       'time': '16:50',
       'name': '开启电灯服务',
       'resource': [{'电力': '1度'}, {'水力': '1立方米'}]
    },
    
    
   
    ]

  }
};