

var data = {
  'code': '0',
  'message': '0',
  'data':{
    'terminals': [{
       'id': 'Tr001',
       'ip': '127.0.0.1',
       'name': '终端名称',
       'desc': '用于管理电源的终端',
       'status': 1
    },
    {
       'id': 'Tr002',
       'ip': '127.0.0.1',
       'name': '终端名称',
       'desc': '用于管理电源的终端',
       'status': 1
    },
    {
       'id': 'Tr003',
       'ip': '127.0.0.1',
       'name': '终端名称',
       'desc': '用于管理电源的终端',
       'status': 1
    },
    {
       'id': 'Tr004',
       'ip': '127.0.0.1',
       'name': '终端名称',
       'desc': '用于管理电源的终端',
       'status': 1
    },
    {
       'id': 'Tr005',
       'ip': '127.0.0.1',
       'name': '终端名称',
       'desc': '用于管理电源的终端',
       'status': 1
    },
   
    ]

  }
};